Repository: clashboom/nvt
Catalog: app/locale/*/LC_MESSAGES/messages.po
Languages: no

source: It is still possible to innovate when it comes to console boat, for which Navette S 565 serves as a good example. Ålesund company has in our opinion created some of the most exciting and innovative bowriders in a long time.
no: “Det er fortsatt mulig å tenke nytt når det gjelder skjærgårdsjeeper, noe Navette S565 er et godt eksempel på. Ålesundsbedriften har etter vår mening laget noe av det mest spennende og nytenkende på jeepfronten på lang tid.”

source: Review from Båtliv (1.0MB .pdf)
no: Anmeldelse i Båtliv (1.0MB .pdf)
