Repository: clashboom/nvt
Catalog: app/locale/*/LC_MESSAGES/messages.po
Languages: no

source: 404 - Page Not Found | Navette
no: 404 - Siden finnes ikke | Navette

source: Sorry, but the page you were trying to view does not exist.
no: Beklager, vi kunne ikke finne siden

source: Not found
no: Siden finnes ikke

source: It looks like this was the result of either:
no: Dette kan skyldes flere ting som:

source: a mistyped address
no: du har skrevet inn feil adresse

source: an out-of-date or incorrect link
no: du har klikket på en lenke som ikke er korrekt eller finnes ikke lenger

source: technical problems on our side
no: det kan være tekniske problemer som gjør at vi ikke kan vise siden

source: If you think this is our fault, please contact us at info@navette.no for help and let us know.
no: Hvis du mener dette er en feil på navette.no, kan du ta kontakt med oss på info@navette.no for hjelp eller tips oss om feilen.

source: About Navette
no: Om Navette

source: Experience, production methods, core values and history of Navette AS
no: Våre produksjonsmetoder, kjerneverdier og erfaring.

source: Who we are?
no: Hvem er vi?

source: what we do
no: hva gjør vi

source: We offer more than 12 years of experience in the composite industry. We have designed and produced a wide variety of composite solutions for maritime and automotive industries as well as for individuals - from boats and auto bodywork to swimming pools and storage products.
no: Navette har over 12 års erfaring med komposittprodukter. Vi har konstruert og produsert en rekke forskjellige komposittløsninger for maritim og bilindustrien, så vel som for enkeltpersoner - fra båterog karosseri på bil til svømmebassenger og oppbevaringsbokser.

source: We do everything from engineering and design to tooling and production as a part of both our own solutions and partnerships. Our production methods are mainly hand layup and resin infusion. High quality and attention to detail are our core values at every stage of the production process.
no: Vi gjør alt fra design og konstruksjon til formbygging og produksjon som en del av både våre egne løsninger og partnerskap. For å produsere våre produkter, bruker vi håndopplegg eller vakuum infusjon teknologi. Høy kvalitet og oppmerksomhet på detaljer er våre kjerneverdier i alle ledd av produksjon.

source: We truly believe that good design not only looks good, but more importantly, works well for the user. A lot of thought has been put into design of each one of our products, to make sure that they are both practical and easy to use.
no: Vi tror virkelig at godt design ikke bare ser bra ut, men enda viktigere, fungerer bra for brukeren. Mye har gått inn i designet bak vært eneste produkt for å sikre at de både er praktiske og enkle å bruke.

source: A Brief History of Navette
no: Historien om oss

source: or how it all came to be
no: hvordan ble vi til

source: Foundation of the Company
no: Stiftelsen av selskapet

source: Navette is founded in Norway. The company is born out of an idea to design and manufacture pleasure boats. Initially there are 3 founders, but later Rune Nilsen buys all shares.
no: Navette er basert i Norge. Selskapet ble skapt av en idé om å designe og lage lystbåter. I utgangspunktet var det 3 grunnleggere, men senere kjøpte Rune Nilsen alle aksjene.

source: Year 2001
no: År 2001

source: Launch of Navette S 565
no: Lanseringen av Navette S 565

source: After a year of hard work and effort, the first fiberglass boat - Navette S 565 is launched into production.
no: Etter et år med hardt arbeid og innsats ble den første fiberglass båten - Navette S 565 lansert inn i produksjon.

source: Year 2002
no: År 2002

source: Availability
no: Tilgjengelighet

source: Production is outsourced to a Latvian company with a goal to cut costs while maintaining the quality. This step results in lower prices and product being more available to the customer.
no: Produksjonen blir outsourcet til et latvisk selskap der målet er å kutte kostnadene mens man opprettholder kvaliteten. Dette skrittet resulterer i lavere kostnader og gjør produktene mer tilgjengelig for kundene.

source: Year 2003
no: År 2003

source: Quality Assurance
no: Kvalitets forsikring

source: To ensure quality control, Navette expands its operations to Latvia, estabilishing a production facility in Saldus. The facility is small but for now - satisfactory.
no: For å sikre kvalitetskontroll ekspanderer Navette sine operasjoner til Latvia og etablerer et produksjonsanlegg i Saldus. Anlegget er lite, men for øyeblikket - tilfredsstillende.

source: Launch of Navette S 540
no: Lansering av Navette S 540

source: The second fiberglass boat in the series - Navette S 540 is introduced to the market.
no: Den andre fiberglass båten i serien - Navette S 540 er lansert inn i produksjon.

source: A Change of Mindset
no: En forandring i tankegangen

source: Due to pleasure boat market being very unstable, a decision is made to also produce other products. At the same time Navette expands to much larger, now its own production facilities near Saldus.
no: Grunnet ustabiliteten i lystbåt markedet bestemte man seg for å også produsere andre produkter. På samme tid ekspanderer Navette seg mye og har nå sine egne produksjonsanlegg nær Saldus.

source: Year 2005
no: År 2005

source: Going automotive
no: Til det automotive

source: In cooperation with Ebil Norge, Navette produces fiberglass bodies for a city electric car - Buddy, the sixth generation of the Kewet electric vehicle.
no: I samarbeid med Ebil Norge produserer Navette fiberglass karosserier en el-bil for bylivet - Buddy, den sjette generasjonen av Kewet elektriskebiler.

source: Year 2007-2010
no: År 2007 - År 2010

source: Production of hardtops
no: Produsering av hardtop

source: In cooperation with Loyds Industri, begins fiberglass hardtop production for Toyota Hilux. Navette also designs and adds a hardtop for VW Amarok to its product line.
no: I samarbeid med Loyds industri startet fiberglass hardtop produksjonen for Toyota Hilux. Navette designer også og legger til hardtop for VW Amarok for deres produksjons.

source: Year 2012
no: År 2012

source: VW Amarok Hardtop - Navette Automotive
no: Toyota Hilux Cargo Hardtop - Navette Automotive

source: Hardtop for VW Amarok
no: Hardtop til VW Amarok

source: This durable and lightweight VW Amarok hardtop uses the exact design elements from the car. The hardtop is made to be flush with the car, giving it a continous appearance and two-box form of a station wagon. Roofshape of the hardtop is styled the same way as car's. It is also the same width as the car itself. Bottom of the hardtop follows the A-line from headlight to taillight, tracing the car's silhouette.
no: Denne slitesterke og lette VW Amarok hardtop bruker de nøyaktige designelementene fra bilen. Hardtopen er lagd for å være i et med bilen for å gi den en gjennomgående utseende og den kjente formen til en stasjonsvogn. Takformen av hardtopen er i samme stil som bilens. Den har også samme bredde som bilen selv. Bunnen av hardtopen følger skyggelinjen fra frontlykt til baklykt og følger hele bilens silhuett.

source: The shape of the side panels adds nicely to the look of the whole car. An integrated spoiler can optionally be equipped with a high level brake light. The hardtop is ready for roof bars by Thule. Navette hardtops are constructed using multi-layered laminated glass fiber mats. The UV-resistant surface is made of durable, very robust Gelcoat. The paint is color coded to the VW Amarok paint codes.
no: Formen på sidepanelet legger seg lekkert til utseende av hele bilen. En integrert spoiler kan eventuelt bli utstyrt med et høyt bremselys. Hardtopen er klar for takstativ fra Thule.Navette hardtoper er konstruert av mange lag laminerte glassfiber matter. Det UV resistente overlaget er lagd av slitesterkt og veldig robust Gelcoat. Lakken er fargekodet etter VW Amarok fargekoder.

source: Features
no: Utstyr

source: Standard Features
no: Standard utstyr

source: Inside sprayed with durable PVC
no: Holdbar PVC belegg på innsiden

source: Integrated spoiler
no: Integrert spoiler

source: Rear hatch with gas struts
no: Bakre luke med gassfjærer

source: Complete fitting instructions
no: Komplett monteringsanvisning

source: Ready for Thule roof bars
no: Klar for takstativ fra Thule

source: Color according to customers needs
no: Lakkering etter kundens ønske

source: Extra features
no: Ekstrautstyr

source: Tinted side windows
no: Fargede sidevinduer

source: LED interior lighting
no: Innvendig belysning LED

source: Rear breaklight
no: Bremselys.

source: Central locking on rear hatch.
no: Sentrallås bakluke.

source: Only for cars with central locking on fuel hatch.
no: Bare for biler med sentrallås på drivstoff luke.

source: Roof bars from Thule
no: Takstativ fra Thule

source: Specification
no: Spesifikasjon

source: Width
no: Bredde

source: Length
no: Lengde

source: Height
no: Høyde

source: Loading height
no: Innvendig høyde

source: Loading width
no: Innvendig bredde

source: Weight
no: Vekt topp

source: Maximum roof load
no: Maks tillatte taklast

source: Width of the side hatch
no: Bredde på sideluke

source: Height of the side hatch
no: Høyde på sideluke

source: Max box size through aft hatch
no: Maks størrelse gjennom akter luke

source: Max box size inside compartment
no: Maks størrelse i topp/innstikk

source: VW Amarok Hardtop
no: Hardtop til VW Amarok

source: Lightweight and durable
no: Lett og slitesterk

source: View category
no: Link på kategori

source: Toyota Hilux Hardtop
no: Hardtop til Toyota Hilux

source: In collaboration with Loyds Industry
no: I samarbeid med Loyds Industri

source: Water
no: Vann

source: About
no: Om oss

source: Contact
no: Kontakt

source: Navigation
no: Navigasjon

source: Sitemap
no: Sidekart

source: Site
no: Siden

source: Top
no: Topp

source: Navette Boats
no: Navette Båter

source: Comfortable bowrider for the whole family
no: Romslig og komfortabel båt til hele familien

source: Excellent boat for sport and leisure
no: Ypperlig båt til sport og fritid

source: Contact Navette
no: Kontakt Navette

source: Find us on map and get in touch - call us, send us a message via e-mail or by filling out the form.
no: Finn oss på kartet. Ta kontakt med oss på telefon, e-post eller send oss en melding.

source: Headquarters
no: Hovedkontor

source: Production Operations
no: Produksjon

source: Managing Director
no: Administrerende direktør

source: Send a message
no: Send oss en melding

source: Drop us a line. We'd be delighted
no: Send oss en melding og vi vil svare så godt vi kan.

source: Name
no: Navn

source: Your name
no: Ditt navn

source: E-mail
no: E-post

source: Your e-mail
no: Din e-post

source: Message
no: Melding

source: Your message
no: Din melding

source: We are proud to have been given an opportunity by Loyds Industri to take part in manufacturing of this exclusive hardtop. The hardtop is designed so that it can include a variety of alternative furnishings - double retractable floor, drawers for storage of tools and possibilities for shelving on one or both sides, all of which is provided by Loyds. Three lockable doors, one rear and one on each side. Both side and rear hatches are fitted with gas struts for easy access. Customized body makes the load compartment water and dust proof. Solid roof rails for exterior roof transportation. And much more.
no: Påbygget er laget slik at det kan inkludere en rekke alternative innredninger fra Loyds - dobbelt uttrekkbart gulv, skuffer for lagring av verktøy, og muligheter for reoler på en eller begge sider. Tre låsbare luker, en bak og en på hver side. Både sideluker og bakluke har gassdempere for enkel adkomst. Spesialtilpasset og vann og støvtett påbygg gjør at varerommet blir lukket. Solide takrails for utvendig taktransport.

source: Please note that Hilux Cargo is a special model developed by Toyota Norway, and is therefore only sold in Norway. If you are located in Norway and already have a Hilux, this can of course be retrofitted on older cars. For more details please contact your Toyota dealer.
no: Hilux Cargo er en spesialmodell utviklet av Toyota Norge, og som følgelig kun selges her i landet. Har du allerede en Hilux, men ønsker påbygget, så kan dette selvfølgelig ettermonteres på eldre biler. Ta kontakt med din Toyotaforhandler for nærmere detaljer

source: Load compartment floor length
no: Lengde vareromsgulv

source: Load compartment floor width
no: Bredde vareromsgulv

source: Max length in load compartment
no: Lenge i topp/innstikk

source: Side hatch opening size
no: Sideluke størrelse

source: Hardtop weight
no: Vekt topp

source: Navette Homepage
no: Navette | Forsiden

source: Composite solutions for automotive industry
no: Komposittløsninger for den automotive industrien

source: Practical multi-purpose boats with emphasis on ergonomics
no: Flerbruksbåter hvor praktiske løsninger og kvalitet er sterkt vektlagt

source: Request a quote
no: Be om et tilbud

source: Interested in pricing? Let us know, please!
no: Ønsker du et pristilbud? Tips oss!

source: Where are you located?
no: Hvor er du?

source: Your place of residence
no: Din geografiske lokasjon

source: Product
no: Produkt

source: What features? When do you need it?
no: Hvilke funksjoner? Når du trenger det på?

source: Need more information? Have any questions, requests or something to say?
no: Vil du få mer informasjon? Har du spørsmål, forespørsler eller annet?

source: Go to our contact page.
no: Ta gjerne kontakt med oss

source: We reserve the right to change the specification without notice. Actual performance may vary individually in relation to the specified test values
no: Vi forbeholder oss retten til endring av spesifikasjoner uten varsel. Reelle ytelser vil kunne variere individuelt i forhold til oppgitte testverdier

source: Navette S 540 - Navette Boats
no: Navette S 540 - Navette Båter

source: S 540 is a fast, yet comfortable console boat, well suited for Nordic conditions and ideal for both sport and leisure.
no: S 540 er en sporty og rask skjærgårdsjeep med sikre sjøegenskaper, ideell for sport og fritid.

source: S 540 is a sporty console boat with great performance. A special emphasis was put on ergonomics during the development of the boat. Seats are comfortable and it is possible to move around in the boat with ease. The cockpit is among the absolute best. The driver has a good overview of instruments and water no matter if standing or sitting. Steering wheel and gas/trim sits right where they should be and there is plenty of room for your legs under the steering consle. The windshield provides good protection behind the control console. The hull has a relatively deep V-bottom which makes the ride soft even in rough waters. Under the console there is spacious storage room, while under the stern bench seat is located battery, fuel meter and a large storage locker.
no: S540 er en sportslig styrekonsollbåt med sikre sjøegenskaper. Under utviklingen av båten er det lagt særlig vekt på ergonometri. Det er enkelt å bevege seg i båten og sitteplassene er behagelige. Førerplassen er blant markedets desidert beste. Føreren kan sitte, halvt stå eller stå og likevel ha god oversikt over instrumenter og farvann. Ratt og gass/trim sitter akkurat der de skal være. Der er god plass til beina under styrekonsollen. Cocpitdybden er 62 cm på det laveste. Vindskjermen gir god beskyttelse bak styrekonsollen. Skroget har en relativ dyp V-bunn - 22 grader. Hekken er spesielt kraftig da motorfundamentet er trukket noe bak hekken og forsterket direkte i langsgående stringere. Båten lander mykt i sjøen, hekken slipper ikke i svinge og det er bortimot umulig å kavitere propellen.

source: Quality - Security
no: Kvalitet - Sikkerhet

source: The boat is self-bailing. Only high quality gelcoat and GRP materials are used in production, ensuring great physical properties and resistance to water. Therefore you dont have to worry about things like osmosis. The composite layer of both hull and superstructure includes stitched triaxial fiberglass mat, which allows for excellent strength-to-weight ratio. All on-board equipment is of high quality. All fittings and accessories are made from corrosion and acid resistant materials.
no: Båten er naturligvis selvlensende. Det er brukt førsteklasses GRP materialer i støpen. Gelcoaten er av en type som har den beste lysekthet og det er minimal vanninntrenging i den. Dette hindrer osmose. Både i skrog og overbygg er det brukt sydd triaksial glassfibermatte. Dette gir et bedre styrk/vekt forhold. Alle beslag og skruer er i syrefast materiale.

source: Padded seats with shock mitigation and flip-up front
no: Polstret sete med vippefront og gassdemper

source: Fixed foldable boarding ladder
no: Fastmontert, nedfellbar badestig

source: Storage compartment for anchor/ropes
no: Stuverom for anker/tauverk

source: Self-bailing system
no: Selvdrenerende cockpit

source: Battery housing with main switch
no: Batterikasse m/hovedstrømbryter

source: Electric bilge pump
no: Elektrisk lensepumpe

source: Lockable room for equipment
no: Låsbare rom til utstyr

source: Fixed fuel tank with capacity markings
no: Fastmontert brennstofftank m/måler

source: Large windshield well suited for Nordic conditions
no: Stor vindskjerm for Nordiske forhold

source: Switch panel with 12V outlet
no: Bryterpanel m/12 V uttak

source: Fire extinguisher
no: Brannslukningsapparat

source: Console cover
no: Konsolltrekk

source: Extra Features
no: Ekstrautstyr

source: Blue/White hull
no: Blått/hvitt skrog

source: Flexiteek deck
no: Flexiteek dørk

source: Canopy
no: Kalesje

source: Pillows for front seats
no: Puter på frontbenk

source: Pillows for rear seats
no: Puter på akterbenk

source: Cocktail table
no: Coctailbord foran

source: Radio/CD player
no: Radio/CD spiller

source: Anti-fouling paint
no: Bunnsmøring

source: Drainage
no: Drenering

source: Manual pump
no: Manuell pumpe

source: Bollard
no: Pullert

source: Boarding ladder
no: Badetrapp

source: Fuel tank
no: Bensintank

source: Anchor compartment
no: Ankerbrønn

source: Cockpit storage
no: Stuverom cocpit

source: Aft storage
no: Stuverom skrog

source: Glove compartment
no: Hanskerom

source: Depth
no: Dybde

source: Freeboard center
no: Fribord senter

source: Height above waterline w/ windshield
no: Høyde over vannlinje m/vindskjerm

source: Weight without motor
no: Vekt uten motor

source: Max payload
no: Nyttelast

source: Max persons
no: Bæreevne personer

source: Min motor power
no: Motor effekt min

source: Max motor power
no: Motor effekt max

source: Category
no: Konstruksjonskategori

source: Bailing system
no: Lensesystem

source: Self-bailing
no: Selvlenser

source: Fuel capacity
no: Tank

source: Storage compartments
no: Stuerom antall

source: Speed test results
no: Fartsprøver

source: Motor model
no: Motor

source: Speed 2 pers.
no: Hastighet knop 2 pers

source: Navette S 565 - Navette Boats
no: Navette S 565 - Navette Båter

source: S 565 is a fast and comfortable bowrider with great ride characteristics, well laid out storage compartments and enough space for the whole family with room to spare.
no: S 565 er meget romslig båt sammenlignet med andre i samme størrelse. Det er lagt stor vekt på ergonomi og det er svært enkelt å bevege seg i båten.

source: S 565 combines advantages of Jeep and bowrider. The boat has Jeepens enkle bruksegenskaper and bowriders protection from weather. The boat has been developed with ergonomics in mind. It is easy to move around in and the seating is comfortable. In the front there is easily enough room for 2-3 adults, while up to six persons can be seated around a table. The cockpit is among the absolute best. The driver can be seated or standing and still have a good overview of both panel and water. Steering wheel and gas / trim sits right where they should be. There is plenty of room for your legs and knees under the steering console. Under the rear seat there is a spacious storage compartment and under the control console - room for fish box, cooler, life jackets, etc. There is also a storage compartment for long items such as fishing rods or water skis. The boat is naturally self-bailing. The windshield provides good protection behind the control console. The hull has a relatively deep V-bottom that ensures comfortable ride even in rough waters.
no: S565 kombinerer fordelene med en Jeep og en bowrider. Den har Jeepens enkle bruksegenskaper og bowriderens beskyttelse mot vær og vind. Under utviklingen av båten er det lagt særlig vekt på ergonometri. Det er enkelt å bevege seg ibåten og sitteplassene er behagelige. Foran er der solseng til 2-3 personer med full lengde. Der er også mulig for 5-6 personer å sitte rundt et bord. Førerplassen er blant markedets desidert beste. Føreren kan sitte, halvt stå eller stå og likevel ha god oversikt over instrumenter og farvann. Ratt og gass/trim sitter akkurat der de skal være. Der er god plass til beina under styrekonsollen og knær kommer ikke i konflikt med noen kanter. Cocpiten er dyp med gode håndrekker. Båten er naturligvis selvlensende.

source: Under the rear seat there is battery, fuel tank gauge, and a large storage compartment. There is also a compartment for fenders, as they are the often dirty and not necessarily to be taken into the boat. All hatches in the cockpit can be equipped with a lock. A gate with sturdy boarding ladder is in the rear end of the boat and sidegate on the port side for easy boarding. Large windshield, thoughtfully organized ergonomic cockpit, canopy behind windshield with room for 6 people, sunbed or seats for up to 6 persons in the bow, large storage compartments with room for seat cushions, coolers, fishing rods, life jackets, water skis etc.
no: Vindskjermen gir god beskyttelse bak styrekonsollen. Skroget har en relativ dyp V-bunn med 21,5 grader i senter vannlinje. Det er håndopplagt med triaksial duk under vannlinjen. Hekken er spesielt kraftig da motorfundamentet er trukket noe bak hekken og forsterket direkte i langsgående forsterkninger. Under benken foran er det rom til alle løse puter. Under styrekonsollen er der plass til fiskekasse eller kjøleboks, samt redningsvester o.l..

source: Only high quality gelcoat and GRP materials were used in production, ensuring great physical properties and resistance to water. Therefore you dont have to worry about things like osmosis. The composite layers of both hull and superstructure includes stitched triaxial fiberglass mat, that allows for excellent strength-to-weight ratio. All on-board equipment is of high quality. All fittings and accessories are made from corrosion resistant materials.
no: Alt utstyr ombord er av beste kvalitet. Det er brukt førsteklasses GRP materialer i støpen. Gelcoaten er av en type som har den beste lysekthet og det er minimal vanninntrenging i den. Dette hindrer osmose. Både i skrog og overbygg er det brukt sydd triaksial glassfibermatte. Dette gir et bedre styrk/vekt forhold. Alle beslag og skruer er i syrefast materiale.

source: Hydraulic steering
no: Hydraulisk styring

source: Tow hook for water sports
no: Vannskikrok

source: Self-bailing cockpit
no: Selvdrenerende cockpit

source: Lockable compartments for equipment
no: Låsbare rom til baggasje/utstyr

source: Switch panel with automatic breakers
no: Bryterpanel m/automatsikringer

source: Blue hull
no: Blått skrog

source: Sunbed
no: Solseng

source: Radio/CD player with 2 speakers
no: Radio/CD spiller med 2 høytalere

source: Fender compartment
no: Drenert stuverom

source: Side gate
no: Sideport

source: Rear gate
no: Hekkport

source: Height above waterline /w windshield
no: Høyde over vannlinje m/vindskjerm

source: Reviews
no: Anmeldelser
